sailingfree/instruments-guition-esp32-s3/src/lvgl_tft_espi_meters.cpp
// Functions fore drawing on the TFT screen using lvgl

/*
Copyright (c) 2024 Peter Martin www.naiadhome.com

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights to use,
copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the
Software, and to permit persons to whom the Software is furnished to do so,
subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/


#include <GwPrefs.h>
#include <StringStream.h>
#include <SysInfo.h>
#include <lvgl.h>
#include <tftscreen.h>
#include <NMEA2000.h>
#include <N2kMessages.h>
#include <sdcard.h>
#include <myFonts.h>
#include <myTime.h>
#include <esp32_smartdisplay.h>

// Forward declarations
static lv_obj_t* createEngineScreen(Screens screen);
static lv_obj_t* createNavScreen(Screens screen);
static lv_obj_t* createGNSSScreen(Screens screen);
static lv_obj_t* createEnvScreen(Screens screen);
static lv_obj_t* createInfoScreen(Screens screen, const char * title);
static lv_obj_t* createClockScreen(Screens screen);

// Static data items for the screens and their data items
static Indicator* ind[SCR_MAX][12];
static lv_obj_t* screen[SCR_MAX];
static lv_obj_t* gauges[SCR_MAX];
static lv_obj_t* needles[SCR_MAX];
static lv_obj_t* vals[SCR_MAX];
static lv_obj_t* infos[SCR_MAX];
static InfoBar  *bars[SCR_MAX];

// define text areas
static lv_obj_t* textAreas[SCR_MAX];

// Define the positions of elements on the screen.
// The elements are laid out in a grid with a header and footer
#define IND_HEIGHT      (TFT_HEIGHT / 4)
#define IND_WIDTH       (TFT_WIDTH / 2)
#define BAR_HEIGHT      (TFT_HEIGHT / 8)
#define BAR_WIDTH       (TFT_WIDTH)
#define BAR_ROW_TOP     (0)
#define BAR_ROW_BOTTOM  (TFT_HEIGHT - BAR_HEIGHT)
#define ROW1            (BAR_HEIGHT)
#define ROW2            (ROW1 + IND_HEIGHT)
#define ROW3            (ROW2 + IND_HEIGHT)
#define COL1            (0)
#define COL2            (TFT_WIDTH / 2)

// Print some text to the boot info screen textarea
void displayText(const char* str) {
    if (textAreas[SCR_BOOT]) {
        lv_textarea_add_text(textAreas[SCR_BOOT], str);
        lv_textarea_cursor_down(textAreas[SCR_BOOT]);
        metersWork();       // Refresh the screens with new info
    }
}


static const uint32_t border = 2, padding = 2;

// refresh the data for a given screen
static void refreshData(Screens scr) {
    StringStream s;

    switch (scr) {
    case SCR_SYSINFO:
        s.clear();
        getSysInfo(s);
        lv_textarea_set_text(textAreas[SCR_SYSINFO], s.data.c_str());
        break;

    case SCR_MSGS:
        s.clear();
        getN2kMsgs(s);
        lv_textarea_set_text(textAreas[SCR_MSGS], s.data.c_str());
        break;

    case SCR_NETWORK:
        s.clear();
        getNetInfo(s);
        lv_textarea_set_text(textAreas[SCR_NETWORK], s.data.c_str());
        break;

    case SCR_SDCARD:
        s.clear();

        if (hasSdCard()) {
            s.printf("SD Card found. Type: %s\n", getCardType());

            // capacity in in MB (1000000 bytes)
            uint32_t capacity = getCapacity();

            // Convert to GiB and print
            s.printf("Sd capacity %d (GB)\n",
                capacity / 1024);

            StringStream str;
            sd.printFatType(&str);
            s.printf("Filesystem type: %s\n", str.data.c_str());

            uint32_t clusters = sd.clusterCount();
            uint32_t freeclusters = sd.freeClusterCount();
            uint32_t blkpercluster = sd.sectorsPerCluster();

            s.printf("Total: %d Free: %d\n", clusters * blkpercluster, freeclusters * blkpercluster);
            s.printf("=======================\n");
        }
        else {
            s.printf("No storage device found\n");
        }
        dir("/", 2, s);
        lv_textarea_set_text(textAreas[SCR_SDCARD], s.data.c_str());
        break;
    default:
        break;
    }
    s.clear();
}

// Constructor. Binds to the parent object.
Indicator::Indicator(lv_obj_t* parent, const char* name, uint32_t x, uint32_t y) {
    static lv_style_t text_style;
    static lv_style_t value_style;
    static lv_style_t style;

    container = lv_obj_create(parent);
    lv_obj_set_pos(container, x, y);
    lv_obj_set_width(container, IND_WIDTH - (2 * padding));
    lv_obj_set_height(container, IND_HEIGHT - (2 * padding));

    lv_style_init(&style);
    lv_style_set_border_width(&style, border);
    lv_obj_add_style(container, &style, 0);

    lv_obj_set_layout(container, LV_LAYOUT_FLEX);
    lv_obj_set_flex_flow(container, LV_FLEX_FLOW_COLUMN);
    lv_obj_clear_flag(container, LV_OBJ_FLAG_SCROLLABLE);

    label = lv_label_create(container);
    lv_label_set_text(label, name);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);


    lv_style_init(&text_style);
    lv_style_set_text_font(&text_style, &RobotoCondensedVariableFont_wght32);
    lv_obj_add_style(label, &text_style, 0);

    text = lv_label_create(container);
    lv_style_init(&value_style);
    lv_style_set_text_font(&value_style, &RobotoCondensedVariableFont_wght64);
    lv_obj_add_style(text, &value_style, 0);
    lv_obj_set_style_text_align(text, LV_TEXT_ALIGN_CENTER, 0);

    lv_label_set_text(text, "---");
     //   lv_obj_add_event_cb(container, my_event_cb, LV_EVENT_ALL, NULL);
}

// Constructor. Binds to the parent object.
// Info bar has the screen title and the time
InfoBar::InfoBar(lv_obj_t* parent, uint32_t y) {
    static lv_style_t style;
    static lv_style_t value_style;

    container = lv_obj_create(parent);
    lv_obj_set_pos(container, 0, y);
    lv_obj_set_width(container, (BAR_WIDTH) - (2 * padding));
    lv_obj_set_height(container, (BAR_HEIGHT) - 2 * padding);
    lv_obj_clear_flag(container, LV_OBJ_FLAG_SCROLLABLE);

    lv_style_init(&style);
    lv_style_set_border_width(&style, border);

