sailingfree/instruments-guition-esp32-s3/src/lvgl_tft_espi_meters.cpp
    lv_style_set_radius(&style, 3);

    lv_style_set_bg_opa(&style, LV_OPA_100);
    lv_style_set_bg_color(&style, lv_palette_main(LV_PALETTE_BLUE));

    lv_obj_add_style(container, &style, 0);

//    lv_obj_set_layout(container, LV_LAYOUT_FLEX);
//    lv_obj_set_flex_flow(container, LV_FLEX_FLOW_ROW);

    // Title text
    text = lv_label_create(container);
    lv_style_init(&value_style);
    lv_style_set_bg_opa(&value_style, LV_OPA_100);
    lv_style_set_bg_color(&value_style, lv_palette_main(LV_PALETTE_BLUE));
    lv_style_set_text_color(&value_style, lv_color_white());
    lv_style_set_pad_all(&value_style, 10);
    lv_style_set_text_font(&value_style, &RobotoCondensedVariableFont_wght42);
    lv_obj_add_style(text, &value_style, 0);
    lv_obj_set_align(text, LV_ALIGN_LEFT_MID);

    curTime = lv_label_create(container);
    lv_obj_add_style(curTime, &value_style, 0);
    lv_label_set_text(curTime, "00:00:00");
    lv_obj_set_align(curTime, LV_ALIGN_RIGHT_MID);
}

void InfoBar::setValue(const char* value) {
    lv_label_set_text(text, value);
}

void InfoBar::setTime(const char * t) {
   lv_label_set_text(curTime, t);
}

//#define BAR_HEIGHT  ((TFT_HEIGHT / 8) - 2 * padding)

MenuBar::MenuBar(lv_obj_t* parent, uint32_t y) {
    // Constructor. Binds to the parent object.
    static lv_style_t style;

    container = lv_obj_create(parent);
    lv_obj_set_pos(container, 0, y);
    lv_obj_set_width(container, (BAR_WIDTH)-2 * padding);
    lv_obj_set_height(container, BAR_HEIGHT);
    lv_obj_clear_flag(container, LV_OBJ_FLAG_SCROLLABLE);

    lv_style_init(&style);
    lv_style_set_border_width(&style, border);
    lv_obj_add_style(container, &style, 0);

    lv_obj_set_layout(container, LV_LAYOUT_FLEX);
    lv_obj_set_flex_flow(container, LV_FLEX_FLOW_ROW);
}

static void buttonHandler(lv_event_t* e) {

    void* target = lv_event_get_user_data(e);
    Screens s = reinterpret_cast <Screens&> (target);
    lv_event_code_t code = lv_event_get_code(e);

    if (code == LV_EVENT_CLICKED) {
        Serial.printf("Target is %d\n", s);
        if (s >= 0 && s < SCR_MAX && screen[s]) {
            refreshData(s);
            lv_scr_load(screen[s]);
        }
    }
}

// Add a button to a menu bar. The callbackl will change the screen to the target
void MenuBar::addButton(const char* label, Screens target) {
    lv_obj_t* b = lv_button_create(container);
    lv_obj_t* l = lv_label_create(b);
    lv_label_set_text(l, label);
    lv_obj_set_flex_grow(b, 1);
    /*Init the style for the default state*/
    static lv_style_t style;
    lv_style_init(&style);

    lv_style_set_radius(&style, 3);

    lv_style_set_bg_opa(&style, LV_OPA_100);
    lv_style_set_bg_color(&style, lv_palette_main(LV_PALETTE_BLUE));
    lv_style_set_bg_grad_color(&style, lv_palette_darken(LV_PALETTE_BLUE, 2));
    lv_style_set_bg_grad_dir(&style, LV_GRAD_DIR_VER);

    lv_style_set_border_opa(&style, LV_OPA_40);
    lv_style_set_border_width(&style, 2);
    lv_style_set_border_color(&style, lv_palette_main(LV_PALETTE_GREY));

    lv_style_set_shadow_width(&style, 8);
    lv_style_set_shadow_color(&style, lv_palette_main(LV_PALETTE_GREY));
    lv_style_set_shadow_offset_y(&style, 8);

    lv_style_set_outline_opa(&style, LV_OPA_COVER);
    lv_style_set_outline_color(&style, lv_palette_main(LV_PALETTE_BLUE));

    lv_style_set_text_color(&style, lv_color_white());
    lv_style_set_pad_all(&style, 10);
    //    lv_obj_remove_style_all(b);
    lv_obj_add_style(b, &style, 0);
    lv_obj_add_event_cb(b, buttonHandler, LV_EVENT_ALL, (void*)target);
}

void Indicator::setValue(const char* value) {
    lv_label_set_text(text, value);
}

// Initialise the graphics
void metersSetup() {

    smartdisplay_init();
    smartdisplay_lcd_set_backlight(1.0f);

    lv_theme_t* theme = NULL;

    lv_disp_t* dispp = lv_disp_get_default();
    theme = lv_theme_default_init(dispp, lv_palette_main(LV_PALETTE_BLUE), lv_palette_main(LV_PALETTE_RED),
        false, &RobotoCondensedVariableFont_wght24);

    //theme = lv_theme_mono_init(dispp, false, &lv_font_montserrat_24);
    theme = lv_theme_mono_init(dispp, false, &RobotoCondensedVariableFont_wght32);

    if (theme) {
        lv_disp_set_theme(dispp, theme);
    }

    // Create the boot screen for bootup messages
    screen[SCR_BOOT] = createInfoScreen(SCR_BOOT, "Boot Messages");
    //Create the rest of the screens.
    screen[SCR_ENGINE] = createEngineScreen(SCR_ENGINE);
    screen[SCR_NAV] = createNavScreen(SCR_NAV);
    screen[SCR_GNSS] = createGNSSScreen(SCR_GNSS);
    screen[SCR_ENV] = createEnvScreen(SCR_ENV);
    screen[SCR_NETWORK] = createInfoScreen(SCR_NETWORK, "Network");
    screen[SCR_SYSINFO] = createInfoScreen(SCR_SYSINFO, "System");
    screen[SCR_MSGS] = createInfoScreen(SCR_MSGS, "N2K Messages");
    screen[SCR_SDCARD] = createInfoScreen(SCR_SDCARD, "SD Card");
    screen[SCR_CLOCK] = createClockScreen(SCR_CLOCK);

    // Load the boot screen
    lv_obj_t* startScreen = screen[SCR_BOOT];
    lv_disp_load_scr(startScreen);

    // display some progress
    displayText("Initialising screens...");
}

// create a container for a gauge or other display object
// setting styles etc
static lv_obj_t* createContainer(lv_obj_t* cont) {
    lv_obj_t* container = lv_obj_create(cont);
    return container;
}

static void setupCommonstyles(lv_obj_t* obj) {
    lv_obj_set_style_pad_gap(obj, padding, 0);

    lv_obj_set_height(obj, TFT_HEIGHT);
    lv_obj_set_width(obj, TFT_WIDTH);
    lv_obj_clear_flag(obj, LV_OBJ_FLAG_SCROLLABLE);
}

static void setupHeader(Screens scr, lv_obj_t* screen, const char* title) {
    // Info bar at the tope
    InfoBar* bar = new InfoBar(screen, BAR_ROW_TOP);
    bars[scr] = bar;
    bar->setValue(title);
}


static void setupMenu(lv_obj_t* screen) {
    MenuBar* menuBar = new MenuBar(screen, BAR_ROW_BOTTOM);
    menuBar->addButton("Eng", SCR_ENGINE);
    menuBar->addButton("Nav", SCR_NAV);
    menuBar->addButton("GPS", SCR_GNSS);
    menuBar->addButton("Env", SCR_ENV);
    menuBar->addButton("Data", SCR_NETWORK);
}


static void setupDataMenu(lv_obj_t* screen) {
    MenuBar* menuBar = new MenuBar(screen, BAR_ROW_BOTTOM);
    menuBar->addButton("Home", SCR_ENGINE);
    menuBar->addButton("Net", SCR_NETWORK);
    menuBar->addButton("Sys", SCR_SYSINFO);
    menuBar->addButton("Msg", SCR_MSGS);
    menuBar->addButton("SD", SCR_SDCARD);
    menuBar->addButton("Clock", SCR_CLOCK);
}



static lv_obj_t* createEngineScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);

    setupCommonstyles(screen);

    setupHeader(scr, screen, "Engine");

    // Create the indicator panels
    ind[scr][HOUSEV] = new Indicator(screen, "House Voltage", COL1, ROW1);
    ind[scr][HOUSEI] = new Indicator(screen, "House Current", COL2, ROW1);
    ind[scr][ENGINEV] = new Indicator(screen, "Engine Voltage", COL1, ROW2);
    ind[scr][ENGINETEMP] = new Indicator(screen, "Temp", COL1, ROW3);

