sailingfree/instruments-guition-esp32-s3/src/lvgl_tft_espi_meters.cpp
       // Save the scale line and image for updates
    gauges[scr] = scale;
    needles[scr] = needle;

    setupMenu(screen);

    return screen;
}

// Screen for the GNSS status and info
static lv_obj_t* createGNSSScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);
    setupCommonstyles(screen);
    setupHeader(scr, screen, "GPS");

    ind[scr][SATS] = new Indicator(screen, "Sats", COL1, ROW1);
    ind[scr][HDOP] = new Indicator(screen, "HDOP", COL2, ROW1);
    ind[scr][LAT] = new Indicator(screen, "LAT", COL1, ROW2);
    ind[scr][LONG] = new Indicator(screen, "LON", COL2, ROW2);
    ind[scr][TIME] = new Indicator(screen, "Time", COL1, ROW3);
    ind[scr][ALT] = new Indicator(screen, "Altitude", COL2, ROW3);

    setupMenu(screen);
    return screen;
}

// Screen for the environmental status and info
static lv_obj_t* createEnvScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);
    setupCommonstyles(screen);
    setupHeader(scr, screen, "Environment");

    // Info bar at the top
//    bars[scr][0] = new InfoBar(screen);


    ind[scr][0] = new Indicator(screen, "Air Temp", COL1, ROW1);
    ind[scr][1] = new Indicator(screen, "Humidity", COL1, ROW2);
    ind[scr][2] = new Indicator(screen, "Pressure", COL1, ROW3);
    ind[scr][3] = new Indicator(screen, "Sea Temp", COL2, ROW1);
    ind[scr][4] = new Indicator(screen, "Wind Speed", COL2, ROW2);
    ind[scr][5] = new Indicator(screen, "Apparent Wind", COL2, ROW3);

    //    // Info bar at the bottom
    //    bars[scr][0] = new InfoBar(screen);
    setupMenu(screen);
    return screen;
}

// Screens for system info
static lv_obj_t* createInfoScreen(Screens scr, const char * title) {

    lv_obj_t* screen = lv_obj_create(NULL);
    lv_obj_set_width(screen, TFT_WIDTH);
    lv_obj_set_height(screen, TFT_HEIGHT);
    lv_obj_set_align(screen, LV_ALIGN_CENTER);
    setupCommonstyles(screen);
    setupHeader(scr, screen, title);

    // Create a text area to display the info text
    textAreas[scr] = lv_textarea_create(screen);
    lv_obj_set_size(textAreas[scr], TFT_WIDTH, TFT_HEIGHT - (2 * HEIGHT_INFO));
    lv_obj_align(textAreas[scr], LV_ALIGN_CENTER, 0, 0);
    lv_obj_set_style_text_font(textAreas[scr], &RobotoCondensedVariableFont_wght16, LV_PART_MAIN | LV_STATE_DEFAULT);

    //    lv_obj_add_event_cb(textAreas[scr], my_event_cb, LV_EVENT_ALL, NULL);
    setupDataMenu(screen);
    return screen;
}

void clockFace(lv_obj_t * parent, uint32_t size);

static lv_obj_t * createClockScreen(Screens scr) {
    lv_obj_t * screen = lv_obj_create(NULL);
    const char * title = "Current Time";

    setupHeader(scr, screen, title);

    lv_obj_set_width(screen, TFT_WIDTH);
    lv_obj_set_height(screen, TFT_HEIGHT);
    lv_obj_set_align(screen, LV_ALIGN_CENTER);
    setupCommonstyles(screen);    
    clockFace(screen, TFT_HEIGHT - (2 * TFT_HEIGHT / 8));
    setupDataMenu(screen);
    return screen;
}

// Update the meters. Called regularly from the main loop/task
void metersWork(void) {
    static const uint32_t tick_delay = 50;
    lv_task_handler(); /* let the GUI do its work */
    lv_tick_inc(tick_delay);
    delay(tick_delay);
}

// Set the value of a meter using a double and precision of 2
void setMeter(Screens scr, MeterIdx idx, double value, const char* units) {
    setMeter(scr, idx, value, units, 2);
}

// Set the value of a meter using a double and set the precision
void setMeter(Screens scr, MeterIdx idx, double value, const char* units, uint32_t prec) {
    if (scr >= 0 && scr < SCR_MAX && ind[scr][idx]) {
        String v(value, prec);
        v += units;
        ind[scr][idx]->setValue(v.c_str());
    }
}

void setGauge(Screens scr, double value) {
    if (scr >= 0 && scr < SCR_MAX && gauges[scr] && needles[scr]) {
        lv_scale_set_line_needle_value(gauges[scr], needles[scr], TFT_WIDTH, (int32_t)value);
    }
}

// Set the value of a meter using a string
void setMeter(Screens scr, MeterIdx idx, String& string) {
    if (scr >= 0 && scr < SCR_MAX && ind[scr][idx]) {
        ind[scr][idx]->setValue(string.c_str());
    }
}

// set using a char *
void setMeter(Screens scr, MeterIdx idx, const char* str) {
    if (scr >= 0 && scr < SCR_MAX && ind[scr][idx]) {
        ind[scr][idx]->setValue(str);
    }
}

void setVlabel(Screens scr, String& str) {
    if (scr >= 0 && scr < SCR_MAX && vals[scr]) {
        lv_label_set_text(vals[scr], str.c_str());
    }
}

void setilabel(Screens scr, String& str) {
    if (scr >= 0 && scr < SCR_MAX && infos[scr]) {
        lv_label_set_text(infos[scr], str.c_str());
    }
}

// Load the first screen
void loadScreen() {
    lv_scr_load(screen[SCR_ENGINE]);
}

// Load a numbered screen
void loadScreen(Screens scr) {
    if(scr >= 0 && scr < SCR_MAX) {
        lv_scr_load(screen[scr]);
    }
}

// Update all the clocks in the headers
void updateClocks(const char * t) {
    for(int c = 0; c < SCR_MAX; c++) {
        if(bars[c]) {
            bars[c]->setTime(t);
        }
    }
}